insta/app/views/posts/index.html.erb

    <p><%= post.content %></p>
    <% post.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?, ?, ?, ?)  [["post_id", 1], ["post_id", 2], ["post_id", 3], ["post_id", 4], ["post_id", 5]]