insta/app/controllers/posts_controller.rb

  def index
    @posts = Post.all.limit(10).includes(:photos)
---
SELECT  "posts".* FROM "posts" LIMIT ?  [["LIMIT", 10]]
SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?)  [["post_id", 1], ["post_id", 2]]

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
      if params[:images]
        params[:images].each do |img|
          @post.photos.create(image: img)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dis pic "], ["user_id", 11], ["created_at", "2019-05-23 06:28:29.915269"], ["updated_at", "2019-05-23 06:28:29.915269"]]
INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "dhao2mmqgdx9mpzvaadf.png"], ["post_id", 1], ["created_at", "2019-05-23 06:28:29.976428"], ["updated_at", "2019-05-23 06:28:29.976428"]]